Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation Class
 Utility functions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.StructuresInstallation
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class StructuresInstallation
Public NotInheritable Class StructuresInstallation
The StructuresInstallation type exposes the following members.
Properties
Name | Description
BinFolder
 Gets Path to Tekla Structures binary (bin) directory.
EnvBaseFolder
 Gets Path to Tekla Structures XSDATADIR directory. XSDATADIR is defined in the teklastructures.ini file. It points to a location, where the installation installs the environment files and folders. Example: C:\ProgramData\Trimble\Tekla Structures\Version
InstallFolder |  Obsolete.
 Gets path to Tekla Structures installation directory.
MessageFolder |  Obsolete.
 Gets path to Tekla Structures messages directory.
MessagesFolder
 Gets a list Paths to Tekla Structures messages directories.
Top
Methods
Name | Description
GetLocalizationFile(String)
 Retrieves localization file from configured environment
GetLocalizationFile(String, String)
 Retrieves localization file from configured environment
Top
See Also
Reference
Tekla.Structures.Dialog Namespace